-- -----------------------------------------------------
-- --------------- coursework.additional_points---------
-- -----------------------------------------------------

INSERT INTO coursework.additional_points (id, merit, points)
VALUES ("Неактивний студент", 0),
("Міжнародні олімпіади", 40),
("Всеукраїнські олімпіади", 20),
("Громадське життя університету", 15),
("Спортивні змагання", 10);

-- -----------------------------------------------------
-- --------------- coursework.control_type--------------
-- -----------------------------------------------------

INSERT INTO coursework.control_type (`name`)
VALUES ("Курсова"), ("Екзамен"), ("Залік");

-- -----------------------------------------------------
-- --------------- coursework.specialty-----------------
-- -----------------------------------------------------

INSERT INTO coursework.specialty (name, N)
VALUES ("Фізика та астрономія", 104),
("Інженерія програмного забезпечення", 121),
("Комп'ютерні науки", 122),
("Комп'ютерна інженерія", 123),
("Системний аналіз", 124),
("Кібербезпека", 125),
("Інформаційні системи та технології", 126),
("Прикладна механіка", 131);

-- -----------------------------------------------------
-- --------------- coursework.faculty-------------------
-- -----------------------------------------------------

INSERT INTO coursework.faculty (full_name, short_name)
VALUES ("Фізико-математичний факультет", "ФМФ"),
("Інститут прикладного системного аналізу", "ІПСА"),
("Факультет інформатики та обчислювальної техніки", "ФІОТ"),
("Фізико-технічний інститут", "ФТІ"),
("Інститут спеціального зв'язку та захисту інформації", "ІСЗЗІ"),
("Механіко-машинобудівний інститут", "ММІ");

-- -----------------------------------------------------
-- --------------- coursework.cathedra------------------
-- -----------------------------------------------------

INSERT INTO coursework.cathedra (full_name, short_name, faculty_id)
VALUES ("Кафедра інформатики та програмної інженерії", "ІПІ", 3),
("Кафедра інформаційних систем та технологій", "ІСТ", 3),
("Кафедра обчислювальної техніки", "ОТ", 3),
("Кафедра математичних методів системного аналізу", "ММСА", 2),
("Кафедра системного проектування", "СП", 2),
("Кафедра загальної фізики", "КЗФ", 1),
("Спеціальна кафедра №1", "СП №1", 5),
("Кафедра конструювання машин", "КМ", 6),
("Кафедра прикладної фізики", "ПФ", 4),
("Кафедра інформаційної безпеки", "ІБ", 4);

-- -----------------------------------------------------
-- --------------- coursework.group---------------------
-- -----------------------------------------------------

INSERT INTO coursework.group (name, first_year, department_id, specialty_id)
VALUES ("ІТ-01", 2020, 1, 2),
("ІТ-91", 2019, 1, 2),
("ІТ-03", 2020, 1, 2),
("ІС-84", 2018, 1, 4),
("ІП-01", 2020, 2, 2),
("ІП-95", 2019, 3, 2),
("ІА-02", 2020, 1, 7),
("КР-73", 2017, 5, 5),
("КП-15", 2021, 3, 3),
("СР-11", 2021, 6, 1),
("ІБ-92", 2019, 10, 6);

-- -----------------------------------------------------
-- --------------- coursework.proffesor-----------------
-- -----------------------------------------------------
LOAD DATA INFILE 'C:/Temp/proffesors.csv' 
INTO TABLE coursework.proffesor
CHARACTER SET utf8mb4
FIELDS TERMINATED BY ';' 
LINES TERMINATED BY '\r\n'
IGNORE 1 ROWS;

SELECT * FROM additional_points;
SELECT * FROM control_type ORDER BY id;
SELECT * FROM specialty;
SELECT * FROM coursework.group;
SELECT * FROM cathedra;
SELECT * FROM proffesor;
SELECT * FROM faculty;

DELETE FROM coursework.additional_points WHERE id > 0;

ALTER TABLE additional_points DROP CHECK additional_points_chk_1;